{"source_file": "audio_files/exten-401-+17046157794-20250728-105337-1753714417.3132.WAV", "transcript_file": "transcripts/exten-401-+17046157794-20250728-105337-1753714417.3132.txt", "duration_seconds": 1476.9, "process_seconds": 88.1, "char_count": 5906, "transcript": "Hello, this is Heather. Hi, good morning. This is David. I thought. Hey David. Yeah, I just emailed you over a proposal. That's the best one that we got back. How does it look? Do your state farm policy. I could not lock in because I haven't been locked in a long time so. But I I do have a paper. I don't know how. Like it just send me to the limit, so I could not lock into the limit. But I like this code. I would like to process with that the one that you just sent to me. Okay, all right. Is it for the premium? Is for the. The whole year's like. Ten hundred something, right. Hold on, let me. I'm gonna. It's through North West Farmers, so let me. I'm gonna go in there and we're gonna walk through this because I have not run any reports. This is just a quote. So that price could change. So let's let's just walk through it. When did you tell me your the state farm policy expired? They expire on July fifteenth. July the fifteenth. Yeah, fifteen. Okay, all right. Hold on one second. I'm gonna see. I quoted it for July twenty sixth. That's probably the latest back date of that. But do you still have a mortgage? No. It's paid off. Your home paid off, right? Yes. Okay, all right. So there's no. No mortgage on the home. You don't have an equity line or anything like that. Open. Right. No, I had. Oh no, it was low. Okay, all right. Let's see. Yeah, I'm just walking through this quote with you while you're on here. See. I know you answered a lot of questions the other day. But just to confirm a couple things. There's been no losses, right? No claims within the last five years. Who? Have you filed any claims against the home within the last five years? All for for for home homeowners. No. No. With the house, I never do a claim. Okay. All right. And the address is near correct three twenty one Natalie Drive and that's N A T A L E L I E sorry. Winston Salem. If everything's so correctly, it's just very like. Can you see your name and your wife's name on there on the proposal? Just make sure everything looks good. Okay. I'm gonna run the report. Oh, oh Heather. Oh, sorry. For each other, you know that my wife's name that they're a little different. My wife's name the same name with me. A lot name. I thought he had a T A W. Oh, I see that they have M. So T A C A W, same as George, right? Yeah, so my wife's name. Thank you. Yes. The same. Okay, I'll get that updated. Hold on one second, and then I'm gonna run the report. And then the one and then the the CC Paul. It's supposed to be S E I S I P A W like. I don't know. Her first name. Yeah, her first name. What is it again? S is in Sam. Yeah, Sam E S L F I S A intelligent. Okay, and what's the rest of it? S E I. S I P A W. S I R. S I. S I P A W. Okay, so I have. Sam Echo. Big Blue. Sam. Big Blue. Paul. He is in Paul or he is in Peter. Alpha is an alpha and W. Yes. So. Okay, E I S I P A W. Correct. Got it. Okay, and then the same as your last day. P H A T A W. Okay. And then her date of birth. December fifteen, nineteen eighty four. Okay, so I had that right. That was correct. Okay. I think on the car issue is probably is kind of like different later day if possible. I would like to correct it. The auto policy is incorrecty. Yeah, yeah, please. Okay, absolutely. Yeah, let's get the homeowners taking care of it. We'll do that. Okay. Because I need to get this in place. I think you're currently not insured, right? For the house. Yeah. No. No. Okay. So that's our main concern right now. See now, what kind of deductible do you want? That you want a thousand or twenty five hundred. I quoted it at twenty five hundred. Oh, if I go five hundred, it's gonna. If I go to five hundred, how much is going to change? Let's see. So we're at. Let me let me change it to a thousand dollar deductible and see what it does for you. Okay, so your premium if we You moved in 2018. You moved in 2018. Yes. All right, David. So it looks like it's 1607, 1607 dollars. I'm okay with it. What is that? I'm okay with that. I changed it to a thousand. It's for a thousand dollars. Is that the goal, Anna? Yes, I would go with that. Okay, 1607. Now, do you want to pay this in full? Yes, okay. Yeah, that's the paid in full discount 1607. You can. Yes, sir. You ready? Give me one second. What kind of card do you have? Please. And a credit card. Okay. All right, how does your name appear on the card, David? David. First name. So it's your first and last name. Yes. Okay. All right, I'm ready for the card number. You want to go ahead and give me that. 4147. 1801. I'm sorry. Let me make sure I get it. 4147. 1801. 1801. Nine five five eight. What's that? Five five five eight. Nine nine nine five eight. Nine five five eight. Six four five four. Six four five four. Okay, I'm going to call that back out to you one more time, hon. I have 4147. 1801. 9558. 6454. All right, and when what's the expiration date? Zero two days. Zero two. Zero one. Two nine. So I have zero one and then two nine. January of 2029. What's the security code? 936. Okay, very good. Here with me one more minute, hon. David, is it okay to go ahead and run it for that amount of 16? All right, David. I'm going to email you this application. If you can electronically sign that for me, that would be great. Okay, is that the payment's go through? As far as I know, it might wait till we actually get the application done. But let's see. Hold on. Let me see if I can get you a receipt. Okay, so they're gonna they're gonna email you this. The it's going to come from Northwest Farmers, David. Okay. The receipt. The carrier we're riding us through is called Northwest Farmers. Okay. Okay, so they're going to email it to you. You can confirm your email from me. Okay, what's your email, David? David, can you hear me? Oh. Can you hear me? Yes. So I'm saying, if you can confirm your email, I have. T. Esentango. Tappal at gmail dot com. Tappal at gmail dot com"}
{"source_file": "audio_files/exten-401-+17046194633-20250825-090823-1756127303.578.WAV", "transcript_file": "transcripts/exten-401-+17046194633-20250825-090823-1756127303.578.txt", "duration_seconds": 1859.2, "process_seconds": 102.9, "char_count": 6914, "transcript": "Thank you for holding, Missus Heather. Heather, this my name is Robert Vaughn, and I was referred to y'all by Roger Kramer, who's a neighbor of mine up here in Shale High, subdivision in Virginia. I'm looking for insurance for to have this house insured that my house up here. Is that something that you you guys? I mean, can you can you sell insurance in Virginia? I don't you know being on the border like this. Okay, I need to get a quote. I've I've been in this actually been in this house about 17 or 18 years and I've had insurance with Rockingham Insurance all the time. I think ever since I got bought the house, but they have gotten so they have gone up so so high. I've got to check and see what's going. You know if I can do do this cheaper because. Yeah. We can definitely quote it for you. I will tell you it's been across the board. We've seen you know significant increases with all the carriers. Right. What insurance do do you guys sell? What company name is. Auto owners have you ever been with auto owners? No. Okay, that Cincinnati. What about Cincinnati? It hasn't been with them either, but that doesn't matter. I'm just. Yeah, those are ours. Our top two carriers for Virginia. I mean, we have a whole list carriers that we like with, so we're going to shop it. Yeah, we're going to quote it. Some of the ones you might be more familiar with is like Liberty Mutual and Travelers. Right, those those those I am familiar with. Well, anyway, it really doesn't it it doesn't matter. But I was just curious. You want me to tell you what the address is and what the current insurance amount is. Yeah, I'm going to get your I'm going to get some information from you. Give me just a second. I'm trying to bring this form up that we fill out for you. Are you from Mount Area Heather? No, I am in actually Clemens. Clemens, okay. North Carolina. Are you familiar with that area? Yes, I am. I am. The reason I asked, yes, I used to have a cousin in that lived in Mount Area for years and. He's passed away since in in the last five or six years, but a lot of people knew knew him. We do have an office in Mount Area and Pilot Mountain. Oh, okay, okay. Yeah, we have actually five locations. Okay, yeah. Okay, and you said you said your name is Robert Vaughn. It's Robert Vaughn, V A U G H N. Okay. This house, go ahead. What the address of the house to be insured will be 141 Alpine Way. Fancy Gap, Virginia, 24328. Okay, how long have you lived there? I have I've had this house for I think about 17 or 18 years. Okay. But but this is this is this is not my current my primary residence. It's going to be very shortly. We're trying to remodel the house. I live in Charlotte now and I'm up here. By I'm retired. I'm 74 years old and we're up here about half the time. But you know still the house my house in Charlotte is. It's actually Harrisburg, but that's suburb of Charlotte. It's my primary. That's correct. That's correct. It is right now. No, when you say remodel, tell me what else going on in the home. What are you tearing down walls or? No, no, no. We're not remodel. Did I did I say remodel? I have remodelled this house in the last five or well, I guess now it's probably been six years. We complete we added about 800 square feet foot to the house and by adding up you know a couple new rooms and. We complete. We remodel the rest of the house. Okay, all right. So what's the total square footage for heated? The total square okay total square footage is 2732. And that's heated. In an air condition, yes. I meant the as far as the square footage that is all heated square footage like. Yes, yes it is. Yes, it is. No, no, no. Well, now it is. It does include the basement, but the basement's completely finished. Has crown molding in it and it's nice. What is the square footage with not including the basement? It would be somewhere around 2, 000 square feet. Okay. And then you have a full size basement. Have a full size but that's finished and has heating and air conditioning. You know just like the rest of the house. Now some of this. The new part of the basement that I So it's one and a half stories. Yes, I guess so. Yes. The upstairs just has one bedroom and that. And a bathroom, completely full bath yes. Okay. So so with the you got your main level right. The main level of home. Um and then if you go upstairs, is it the same square footage upstairs as it is on the. No, it's not. No, it's not. That the the one and a half. Yes. Okay. But I'm not. I'm you know I really need to get this. I've been aiming at this house appraised and see what they say on this square footage because I mean in my in my estimation I think the basement would be counted as. As total, you know it's probably the whole basement is probably over half out of the ground. And. But you know I have. We include that it's included when we when we run the replacement cost estimator. But it every house I mean you know you got your main level, not counting the basement. Okay, the basement is never counted as total square footage. Heated square footage. Okay. It's included though you know when we're filling out this. It's called a replacement cost estimator. Right. But they're just wanting you know how many stories it's it's one and a half stories you don't count the basement. Right. Okay. And then it'll ask does it have a basement? Yes, is the basement. Um, finished or unfinished or fifty percent you know so we put that in there so we'll put one hundred percent finished for the basement. It is a walkout basement right. It has all these details. Yeah, that's what a walkout basement. So um, but yes, this would be a one and a consider a one and a half story home. Um, you just count the heated square footage. For the the primary level and the upstairs. And then we do but we do include the basement, just not in it in this primary heated square footage. Okay, okay. Yeah. Is there a garage attached to the home? No, there's not. Okay. All right, and you said there's central heat near. Correct. Okay. All right. Do you have any detached structures like a detached garage or? I have a detached what I'll call a utility building. You know where I got lawnmowers and garden you know tools. Okay. For outside. How many acres are you on? I'm not on it. This is about half an acre. Okay. All right. This is more like a a neighborhood. Okay. Okay, is there an HLA? Yes, there is. Okay. Is it a gated community? Um, it depends on what I get. Would you have to have a you know there's a gate there but they don't use the gate. I mean the gates open. I I don't know if you would classify this as a gated community. There's signs that says no no admittance and except you know members or whatever. Okay. Okay, but my wife can hear me and she says it's not wouldn't be considered a gated community then. Okay. But there is a fence there or a gate. Yes, there is. Yes, but it's not. Yes, but it's not"}
{"source_file": "audio_files/exten-401-+17046194633-20250903-151053-1756926653.9117.WAV", "transcript_file": "transcripts/exten-401-+17046194633-20250903-151053-1756926653.9117.txt", "duration_seconds": 1568.1, "process_seconds": 122.4, "char_count": 11635, "transcript": "Hello, this is Heather. Heather Robert Vaughn again. Hey. Hey, I'm going to be the the craziest client you've ever dealt with. I'm still working. Now I look at this and this this scares me because it's too cheap. I'm sorry I didn't. What'd you say? I said. What I said, I this worries me because it's too cheap. I mean you know the. Oh oh oh okay. Okay, now this is you know now number one and and listen you know I don't know what I'm doing I sold real estate in the past but I've never sold insurance so I don't know anything. Now one thing I don't like is I don't like this this company name of auto owner's insurance. I you know I mean doing a house I mean I would prefer to do something. I mean if it had been you know it could have been one of. Twenty five names you know somebody like Progressive Farmers. Okay. All right. You know a company that we we know. And another thing about it, you know you've got the the dwelling limit on this thing is 392. And I would prefer it to be something like 425. Okay. Now the the you know they're kind they're a little bit let me explain we had we had a smaller house up there. We built on to the house, put two rooms that added about a thousand square feet to the house. And I don't to be honest with you I don't think Carroll County has got it straight. How you know I mean they the house had a building permit and they passed the permit but to me they kind of screwed up with their data and I'm certainly not going to go to them like it's it's be telling me telling them hey I want a higher tax bill up there you know. Right. But anyway I would like the dwelling to be like 425 or something like that. And. I'm just going to walk through it while we're. While you're telling me. And of course whatever you know these what I'm sure the computer gives you these. You know this personal property and everything and it probably has some formula to it. It's the percentage of the dwelling. Yeah. Yeah. But now I can drop it because this is your secondary home right. It is and I have no. I mean I think this thing is realizing that you know I don't have a mortgage on the house. Okay. So I dropped it to 2125. I increased coverage A the dwelling to 425 and I dropped coverage C the personal property to 2125. Okay. Okay. Yeah. Um. So. Um. Let's see now the deductible and what was the deductible I I look at so much. 2500. I would prefer the the deductible. The. A thousand. Yes. Okay. Okay. I bet you don't have many people too. No, they do. They do. Yeah. Yeah. You know I want to feel comfortable about the thing you know. Yeah. And have we gone? Usually have you know. It's usually more. It's usually they're like I don't believe my home. Worth that much or the replacement cost you know but just keep in mind the market value is different than the replacement cost. Right and this is a very unusual house. I mean I I wish you could see the house. There's probably not a house. There's 60 or 65 houses in in this development. And I guarantee you mine is as far as you know. Interior of you know like moldings and stuff. It's it's not the typical house but you know most people would probably want more of a log cabin for what they want but mine's not that way. But now is it a log cabin? No, no, no. I said most people prefer a log cabin. No, it's saying prefer a log cabin for you. Okay, got you. I was like I don't I don't think I call that a log cabin. Okay. Alright. Um. But yeah. Um. So yeah I I up the deductible or increased it. Yeah. I changed the deductible from 25 to a thousand. Okay. All right and then increase the um. The dwelling. Okay, and have we got somebody? I mean, you you you are agents for a lot of. I mean, you are independent, I guess. And. Right. So have we got a, kind of a company that you know you. Used to hear in any. So unfortunately, no. We write all most the majority of our business is written with Auto Owners in Cincinnati. Um. They have been around since like nineteen nineteen sixteen. Out of Michigan. Right. They are one of our top rated carriers. Like I said, Auto Owners, Cincinnati, Penn, Penn National. Those are the main the three that I typically try and write with. Now we do have Travelers. Travelers don't do it unless unless you have Auto to go with it. And that's the thing. Most of my carriers, Safeco, Liberty Mutual, you've got to have another line of business. Right, I understand. They won't. They are not writing just a monoline home. Right, I understand. I understand that. So that's why Progressive won't write it at all. They're they're not in that market anymore. Hey, well, did you mention? I'm sorry. But we I mean we we do write with Progressive, we but not homeowners we write with. Liberty Mutual or Safeco. Travelers. Trying to think of somebody else you might more familiar with, but yeah, I'll tell you Auto Owners and Auto Owners Penn National. And Cincinnati. Okay. Who my go tos are and and Liberty Mutual, but like I said, you got to have. Got to have part. Right. Another. Yeah. Okay. So I mean, do you do you like this Auto Owners? You prefer them over the Cincinnati. They're they're there together. They're my top two. Yeah, I don't prefer one or the other, but they are over the other. I would I would feel totally. I mean, this is is is a highly rated company. The Auto Owners. It is. And Cincinnati is the same. They won't take it unless we got another line of business. Right. Okay. So I that's why I said I'm limited to so who I can quote it with whenever it's just. Just one line of business. Okay. Okay. And I and the way this thing is, I'm I'm a little bit confused that the coverages that apply on this sheet. Now is that saying that? I mean, what what is that? What are these things saying like refrigerated product coverage? I mean. Now those um you don't have to have those those are just some of the common endorsements that we add on to the policy. They're not necessary. They're not included. In the standard policy. Um. And and like I said, if you don't feel like you would use any, I know this is what your secondary home. Yeah. But yeah. You know I don't. Are we saying that I've got these items? I mean, do all of us. Okay. We'll look at that extra expense per month. I mean, I. You know I don't have a mortgage. Um. Now something like this tree debris removal. Thousand dollars, you know, in the mountains that might be. I mean, that is that the maximum what we're saying would be the maximum limit on. Yes. Okay. That. I would probably need to go up to several a couple of thousand dollars on that. I mean, if you got the ability to do that. I don't. Let's see. Hold on a second. Let me look back. Because you're in Virginia and some of these kind of. Um. They're they're a little bit different than North Carolina, what I'm more familiar with. Um. There's different forms for Virginia. Let's see. Yeah, that's the max that they will. That's the max on the debris removal. Okay. Now on this glass breakage. Um. Is there a max? I mean, it's what it doesn't look like I've got a figure over there under the limit. Is that. What was that again? What was that for? Glass breakage. It says two fifty's. The deductible, which is fine. But I mean, what is there a max on that? I don't know. I don't even see that. Let's see. I'm in the policy. I'm not looking at the quote that I sent you. I'm actually in the the carrier's website. Um. And I'm trying to find the glass. Where do you see that at? Yeah, coverages that apply. You know it's on the first page at the bottom of the first page. You know it has it's got coverages that apply. So that's that's what it says. Glass breakage. What are some of those? The mastic appliance, seepage or leakage, increased costs, endorsement, personal property replacement cost. Yeah, I see all that. All right. Is this glass breakage is the one right after trade debris removal. Gotcha. I see, I don't see that, but yeah. I still don't see it, but not on this where I am at. But is there a limit? Well, that's what my question is. It doesn't look like there is. I mean, it says 250 deductible, but it doesn't look like there is a limit. I mean, there is a limit. Okay. I mean, that's what I was going to ask about the limit. I see. I can find what I need because it looks different in the policy. Right. You all pan know I notice one here says equipment breakdown coverage. Do you have any idea what that? Yeah, now that's like any like your HVAC if it was to go out, but it now can't be due to wear and tear. It's almost like a warranty. Like on your appliances, there. Right. Okay. But again, sometimes people you know it. Most of them do the wear and tear, right? Or you you have a warranty when you purchase it or whoever you know. But similar to that. Yeah, this service line coverage. Yeah, that that's going to be like. Like the water line or power line. Yeah, going from your house to the the public utility. Okay, okay. All right. Well, if we I guess if we if we can just up the coverage of what what we you got it now when. Um. Send that to me and let me. This is this is annual right. Oh yeah, it is. Okay. Did what, Betty? Are you in an HOA? We are. I wouldn't call it an HOA. We're in a you know a. Shall a high corporation you know or we don't have an HOA. Would you call it an HOA Betty? You know they don't do our they don't do the mowing and they don't have any cat they don't have any. You know, don't paint your house every so often or like you know like a lot of HOAs. I mean, it's just you know it's just a it's just kind of a group of the homeowners. You know they it's the rules of the you know what you can do at the. On the on the you know on the when you are in the property you know. Well, I yeah well I guess it is an HOA, but you know it's. Yeah, it's about three hundred dollars a year. I mean, it's not you know I mean they they got common area tennis courts. You know, you know different stuff like that roads. You know the. But it's not like some HOAs, but I guess I guess it is. Does that make a difference? Well, no, I am just looking through some of these coverages like the equipment breakdown and service line. Did you did you want to keep that on there? Like all these additional. The reason I asked that and the reason I asked that. You know we're getting from the power company we have Appalachian power up there. I mean that's the name of the power utility. And you know they're sending something all the time trying to add on to your bill for covering you know if the if the power line breaks or something you know covering the the fee from the transformer to your house and all that. And and I am just trying to find you know I. They even worry me down here in Charlotte about that. I mean the Duke Power even does that. And but if you have it on your insurance, you certainly don't need to be paying it again. You know. Exactly. Okay. Yeah. Yeah. Now that's the only reason I ask about a lot of these things. I think people don't realize they they they might have it on homeowners. They only realize they have it. You know. Right. Yes. So what was that premium sent you earlier? The primary premium you sent me earlier was taking the paid in full discount off. The premium before that was thirteen twenty seven point ninety two and then they give you a one thirty two point eighty one discount for paying full discount and. Premium would be eleven ninety five eleven. See, it says new premium after making those changes adjustments. We dropped the deductible down to a thousand increased to four twenty five for the dwelling. It's thirteen seventy six eighty five. Okay, so I mean it really didn't make, but about"}
{"source_file": "audio_files/exten-401-+17048287661-20251006-152917-1759778957.11256.WAV", "transcript_file": "transcripts/exten-401-+17048287661-20251006-152917-1759778957.11256.txt", "duration_seconds": 58.0, "process_seconds": 6.5, "char_count": 849, "transcript": "Thank you for holding. This is Heather. Hi, Heather. My name is Ashley with Van Dyke Mortgage. I was calling to see if you have that evidence of insurance available today for the McDowls. Oh, I do, girl. Yes. I am so sorry, I haven't got that over to you. No, if you could, that's all I'm waiting on to get this back into underwriting since they're trying to close lately. Yeah, that's all I need. Yeah, me and um, Tina have been back and forth over the weekend. Um, actually just coming back off a vacation today, so and I just had a client leave. I've been spending like an hour and a half with him, and every time I go to do it, some calls are coming in. I completely understand. Yes, ma'am. You are on my list, and I will get that over to you here in just a few minutes, son. Okay. Thank you. That's all. Thank you so much. You are welcome. Bye."}
{"source_file": "audio_files/exten-401-+17439006517-20260119-132359-1768847039.3442.WAV", "transcript_file": "transcripts/exten-401-+17439006517-20260119-132359-1768847039.3442.txt", "duration_seconds": 59.3, "process_seconds": 6.9, "char_count": 857, "transcript": "Hello, this is Heather. Hey, this is Dylan. I just called a few minutes ago. Yeah. Um, so I'm on the canopy connect and I've added nine and my wife's name on the drivers. But when I go hit when I go to hit done, it just sends me to YouTube blink and I don't know what to do after that. That's it. That's it. Let me take it. Yeah, I know it's a little quirky at the end, but if you've got YouTube that sends you there, let me just. Yep, I have received it. I got it. Did you do it a couple times? I think so because I did nothing at all. I got it. I should have told you that. Like it's yeah, it's a little weird at the end. I don't know why it's it's like our commercial on YouTube, but. Um. Yeah, my my apologies for not giving a heads up. Once you get to YouTube, you know you've done it. So you're good. Okay. Thank you. Thanks for that. Absolutely. Bye."}
{"source_file": "audio_files/exten-401-+17578487350-20260109-151659-1767989819.5723.WAV", "transcript_file": "transcripts/exten-401-+17578487350-20260109-151659-1767989819.5723.txt", "duration_seconds": 1040.6, "process_seconds": 65.4, "char_count": 3728, "transcript": "Thank you for holding, Heather. I'm sorry, hello, this is Heather. Hey, Heather, this is Tim Smith. Happy New Year, too. How you doing? Doing good. Happy New Year. I have a question for you. I started a ticket at the last hour of the on a Friday, but I wanted to. Sorry about that. I wanted to give you another vehicle VIN number for our for the said auto policy for Timothy and Albonia Smith. And I can give you that policy number. Okay, I got your policy. What's the VIN number? All right, so I'm going to sell. I'm going to sell the. I'm possibly going to sell the 2015 Lexus. And I'm going to replace it with a 2023 Lexus, and that VIN number is going to be. Let's see here. It's going to be. Maybe I shouldn't buy it. Let's see here. It's going to be 58AFZ1B10PU160155. Wanted to see what the impact would be. Okay, so I have 58 Alpha Fox Trot Zebra One Bravo One Zero Paul Umbrella One Six Zero One Five Five. Yes, ma'am. Okay, and it's you're going to do your replacement with the 15, same coverages, keep the same coverages. Okay. Whatever you recommend, if you the same coverage is what you recommend, that's what we'll go with. Is there going to be a? Are you financing this vehicle? Is there a lien holder? Yes, probably going to be a lien holder. Let me. So is there a difference in insurance if I if I buy it? Would it be a reduction? Oh, no, versus financing. It's not. No, it's not. No, it's not going to be. Let's see. Are we we have you with Cincinnati? Is that right? I know we have you with Cincinnati. I think pretty sure. Let me see here. Let me see. Yes, I'm pretty sure. Let me see here. I'm pretty sure it's a. Cincinnati Insurance Company. Yes, ma'am. So that's that's both looks like both home and auto because it gave the best rate at the time. That's right. I'm hoping it doesn't hit me too bad. Let's see. About the 2015 Lexus that we're removing. That you're trading. You're going to trade it in. Yes, ma'am. Are you at the dealership now? Oh, I'm not. I'm just. We can't come to a number as of yet. Oh, but I'm just. I'm just checking everything to see what my impact if I if I. We're about 1700 off right now, and I'm trying to resolve that. But I just wanted to see what my insurance impact would be. Okay, so we're not actually doing it. You're just you're just wanting to see it. I'm not going to endorse the policy yet. Okay. Right, is that is that what you're saying? Yes, ma'am. That's correct. I just want to see what my impact would be. All right, and this is pulling up a 2023 Lexus ES350 Ultra Luxury. Yes, ma'am. All right. So is this vehicle going to be? Is it going to be driving at primary? Like a primary driver, or is this going to be a pleasure vehicle? That's just going to be the pleasure. Okay. I still drive that truck. Okay. Yeah, so I have your deductible 250 for both comp and collision. And then we've got the roadside assistance and rental transportation on there. So I'm just going to leave that the same. That's what I recommend keeping it the same across the board. And you've got the higher liability limits, which is good. So you've got 250, 500 liability. I'm just waiting to populate the premium difference. So it's it's going to be pro-rated from now through April because that's when your your term renewed in April. Yes, ma'am. Let's not give me like a breakdown, but it is it's going to be more. Your premium from now till April is. It's 2237. See, you know what your premium was before. I can go back and look. I think that's a lot more. Yeah, 2237. Well, that's not too bad. I think that's was about 10 more. Let me see here. I still less than 200 a month. Right. What's your what's your monthly payment now? 181. So that puts me about 191. Let's see. 2150."}
{"source_file": "audio_files/exten-401-+18324923386-20250902-144230-1756838550.6560.WAV", "transcript_file": "transcripts/exten-401-+18324923386-20250902-144230-1756838550.6560.txt", "duration_seconds": 539.6, "process_seconds": 43.4, "char_count": 4157, "transcript": "Thank you for holding, Missus Heather. Heather Tommy Cole, how are you? Hey Tommy, good. How's it going? Good. I just sent you. I think I sent it to the right email address. You know we're moving and I'm renting a house for a year. And I need to get renter's insurance. And it needs to be one hundred thousand dollars. Minimum liability and whatever. But I sent you the information about who the other insurer is, that kind of stuff. And the address and all. Could you check and see if that email went through? I'm not sure I had the right email address. Yeah, I mean I received the first email I received from you. Yeah, but I didn't. Yeah, I didn't see the information with that one. Right. Okay. I think I just. I took a screenshot of it. Gotcha. Okay, so you're you just need a renter's policy. One hundred thousand liability. We don't write less than five, but it's only like three dollars difference from one hundred to five hundred. But yeah, I can get you a. Yeah, I can get you a proposal. How much do you have in personal property? You know I had no idea, but it's less than that for sure. No, that's reliability. That's not that that's what's required from from the. Yeah. The management company, but that's reliability. That's not for your anything. Oh, okay. Oh, for us, I mean, gosh, I don't know. I had no idea. What do you think? How many bedrooms is it? Yeah, how many? It'll be four bedrooms, three baths, twenty four hundred square feet. Is it one? I was going to wait. Is it? Yeah. Is it fully furnished? Well, it will be. Yeah, we we're going to furnish all the bedrooms. Okay, all right. Yeah, I mean that's. But I mean, I'm furnishing the. We we had to take custody of two grandkids. They're three and eleven, and you know, I'll have less than a thousand dollars in their two bedrooms because we're buying used stuff. Okay. No longer. Yeah, I mean that's what I'm saying like that. It's hard for me to say. You kind of just need to take inventory, you know, and. I mean, because some people have, you know, they go shop somewhere. Well, it's that you said the bedroom sets like confinement. Well, it's a big difference. Confinement. I don't know. Just you know. If I mean, if I was to say fifty thousand, would it be a big difference if I said one hundred thousand between the two or? It's not about one hundred dollars. Maybe different. Well, maybe. I mean, they're very they're fairly inexpensive. You're you're looking at maybe three hundred dollars for the year. Yeah, well, maybe just go with say seventy five thousand dollars of property. That's why I was. I mean, it was like on a three or four bedroom home. Yeah, that's seventy five to one hundred. Yeah, did you did you get the one I just sent with the screenshot showing the insured name, property location, policy number, all security. Yeah, I got that and the additional interest. Yeah, okay. So you guys are just going to be renting this home. Yeah, I don't have time to even think about buying something. We had to do this on a rush rush basis to get the pool and all that. So what about your your primary residence? The condo. I'm going to eventually sell it, but after we get moved out and I get it cleaned up and the paint, stuff you know and all that, I'm going to put it on the market. But I'll let you know when that happens. Okay, all right. So what who is staying there now? Anyone? Well, we're all staying here until the fifth of September. I mean, the ninth of September. We're moving on the ninth of September. Right, but who who will be in the house? Is it going to be empty vacant? You mean the condo? The condo. There'll be nobody living here. I'll be over here every day working on it, but nobody living here for probably a few weeks until we get sold. Okay, all right. So you you're not doing any extra construction. Oh no, no. I'm just going. You know, when you take stuff off the walls, you got to. Hey. Fill in the holes and all that kind. So you're only talking about the empty vacant for maybe a couple a month or so. Once you get all that done, you're going to list it for sale. Okay, I'm just trying to figure out what I need to do with that that"}
{"source_file": "audio_files/exten-401-+18568168648-20251201-115231-1764607951.5860.WAV", "transcript_file": "transcripts/exten-401-+18568168648-20251201-115231-1764607951.5860.txt", "duration_seconds": 396.2, "process_seconds": 38.4, "char_count": 4071, "transcript": "Thank you for holding. This is Heather. Hi, Heather. John Mastasi. Sorry, I just missed your call. Yeah, yeah. How's it going? It's it's going all right. Waiting for settlement to occur here, but again, I got a call last week from New Jersey manufacturers, and they want me to know soon as settlement's over. So my concern is: Is it possible to make my insurance effective midnight tonight for tomorrow? In other words. Let me see. Sometimes. I know we have an effective Tuesday. I think right. Yeah, I think so. What day John? I just want to make sure I'm covered for a drive down. I'm not driving down, so we're going to get wait for settlement to be finished. Right. Finish packing, spend the night in a hotel here, and then drive on down. Yeah, I'm covered. My policy has not expired. You are right. Yeah, yeah, you would definitely be covered. Yeah, we did it for the third, which that that means it tomorrow at midnight. So. Yeah. But my drive, my drive won't be. I'm driving tomorrow, so my question is: Is it possible to make that your policy effective midnight tonight? I can call Cincinnati and see. Usually they are going. Usually they will require us to cancel these policies and then rewrite them. It's not you would think you could just switch the. I know you would think it would just be simple to change the date, the effective date, but most of the time the carriers require us to do a cancel rewrite. But I I mean I'm telling you like you would you're going to be covered. New Jersey is covering you up until midnight tomorrow night as well. How do you know that? You haven't canceled. You haven't canceled that policy. I had not canceled that policy, but they want to know the minute I move out of this house. Basically, is what they're saying. But then they say something about there's a 30 day rule. So I don't know what. It is yes you don't have to yeah yeah I mean that's what I'm saying you do not have to cancel your policies until the third. And you you don't have to cancel them on the third. You could still yes I mean you you have I don't know if it's 30 days in New Jersey but there is there's like. As far as are they talking about your homeowners insurance? No, they're talking about the whole package. I I've been talking mostly to them. I told them I was going to cancel the homeowners. And I guess the umbrella, you know, once you know once we are officially not the owners of the house. Excuse me, but I'm very concerned about the auto coming on down there. Basically, you know. Well, the auto is definitely covered. Yes, yeah, and that's what I'm saying. You could you you could not cancel your auto with them until like 12:15. If you wanted to, but I mean you're going to be covered. You can cancel it at midnight 12:00 on the third. Tomorrow night at midnight. That's what I'm going to do. Okay, very good. Yeah, thank you very much. You're going to be covered. Yeah, if you're driving tomorrow, then they're covering you up until. Well, they're going to cover you up until you cancel it with them. Cancel. Yeah, right. That's what I'm playing. And then you'll also be covered come midnight. 12:01, you'll be covered midnight. I'll understand that you see. Yep. 12:01, but I'll be down. Yeah. Right. 12:0. You're saying 12:01 on today's Monday. You mean on tomorrow night? Right. 12:01 tomorrow night. Right. Is that what you're saying? It'll be 12:03. Yep. Yeah, because tomorrow will be December the second. Up until 12 o'clock, 12:01, it'll turn 12:03. Right. December the third. So Cincinnati kicks in then at 12:01 tomorrow night. Yeah, I just want to make sure New Jersey is going to cover you. Yeah, they're they're going to cover you until. Oh, absolutely yes. Yeah. I'll cancel our policy on Wednesday. I don't know. Yeah, I don't know why they're making a big deal about that. I don't know why either. Because you do they allow you X amount of days like I don't know what their their requirements are there but I know. Now as far as the home, you don't cancel that insurance until you close. Wendy, I'll close on that home"}
{"source_file": "audio_files/exten-401-+18886726551-20250923-130220-1758646940.3159.WAV", "transcript_file": "transcripts/exten-401-+18886726551-20250923-130220-1758646940.3159.txt", "duration_seconds": 64.9, "process_seconds": 6.3, "char_count": 844, "transcript": "Hi, good afternoon. This is Mariana from Pants. dot com. How are you doing today? I'm doing good. How are you? I am doing fine as well. Thank you so much for asking. So I'm actually calling today to introduce myself to you since I have been. I'm reaching out to you to let you know that I am your sales rep. So whenever you need to order, you can reach out to me for better deals on our website. And also, I am the one that has been sending the samples to you in the mail. Okay, yeah, I did receive your email and thank you so much for reaching out. So at the time, I'm good. But I definitely saved your information and I will reach out directly to you whenever I'm ready to order again. Okay, great to hear. And thank you so much for your time today and you enjoy the rest of your day as well. Thank you, you too. Bye bye. You're welcome. Bye."}
{"source_file": "audio_files/exten-401-+19089062525-20251107-105617-1762530977.1629.WAV", "transcript_file": "transcripts/exten-401-+19089062525-20251107-105617-1762530977.1629.txt", "duration_seconds": 211.9, "process_seconds": 20.6, "char_count": 2215, "transcript": "Hello, this is Heather. Hi, that is then. Good morning. Hey, good morning. And how are you? All right. Um, I got your message and the one that you, for the for the contents like that. But I don't know how to open the P D P D X. P D X. Okay, can I go to your place? You sure can. After noon. And can I have your address? Yeah, after my physical data. I'll go there to you. Okay. Um. Which office is going to be closer to you? I'm here. The point. So we have a. I'm in Clemens. I have one in Winston Salem. Um Mount Airy Pilot Mountain. And Walnut Airy. Winston Salem is. I think it's much better. I think so. Okay. So. Clemens, right now is that Winston Clemens. Winston Salem. So um so yeah, the one in Clemens is just past Winston Salem. Going west. How many minutes will it be like twenty minutes? Um, I don't let me give you both addresses. And um, you can you can Google it or see like if you have a. Ways or something on your phone that where you can put the address in. Yeah. And see which one you think is going to be best. But either you can go to any of our offices. You are you're you're in the office in the Clemens. I'm in Clemens Fifth Man. Okay. Yeah. Good. After my physical data. Okay. No. That's fine. Let me give you the address. Okay. It's going to be two two two five five. What is it? Twenty two fifty five. Twenty two fifty five. Louisville. How do you spell it? It's yeah, it's L E W. I S W I S Louisville. Okay. Louisville V I L L E Louisville. Louis. What? Louisville Clemens Road. Louisville. Uh huh. Clemens. And that's weird. And it's sweet C. Sweet. The uh sweet the sweet. Yeah, it's C C. And I'm going to text you. Yeah, I'm just going to text this to you as well. Oh yeah, text it to me. Yeah, that'll be better. I need a hearing aid. Yeah, that'll be much better. Okay, okay, thank you, Heather. I'll text. Before. Before I even live here, I will call you so you will. Oh great. Okay, that sounds good. Yep, that sounds great. And you need my policy number right for the loan loan policy number. The loan number. Yes. Okay. Yeah. Okay. Okay. That's that's all I needed. Okay. All right. I'm sending it right now. Okay. All right. Thank you much. Okay. We'll see you then. Okay. Bye."}
{"source_file": "audio_files/exten-401-+19089062525-20251107-130431-1762538671.3877.WAV", "transcript_file": "transcripts/exten-401-+19089062525-20251107-130431-1762538671.3877.txt", "duration_seconds": 20.6, "process_seconds": 2.0, "char_count": 244, "transcript": "Hey Eden. Alright, Dad, I just finished my typical dinner. I'm leaving in about six twenty five minutes. Okay. I'm here till five o'clock today, so you come on whenever you can. Okay. Okay. All right, we'll see you soon. Be safe. Bye. Bye. Bye."}
{"source_file": "audio_files/exten-401-+19102120755-20250814-145850-1755197930.6381.WAV", "transcript_file": "transcripts/exten-401-+19102120755-20250814-145850-1755197930.6381.txt", "duration_seconds": 824.5, "process_seconds": 54.9, "char_count": 4070, "transcript": "Hello, this is John Curley. Hey John. I got the number for you. All right, I am ready. Okay, one C four P J M is a Mary and then another M, then an X O M D one six zero zero eight one. All right, and what is that? What's the year making model? It's a Jeep two thousand twenty-one. What type of Jeep is that? Well, that's a good question. Is it a Cherokee or a? No, it's a full. Like a station wagon. Is it a latitude or sometimes? Yes. That's it. Yes. I think that's what it is. All right, very good. Okay, and did you get your coverages? Were you able to find out what you are carrying on those? No, I have a five hundred dollars deductible. That's the only thing I know. I just found my my voter my vehicle registrations. What I am looking at. Gotcha. That's fine. And all right, but you know you do have a five hundred dollars, collision deductible. Yeah. All right, very good. Let me run some numbers, John, and see what we can do for you. Do you know how much your regular policy is? No, I don't. Okay. Well, I paid for it last year. You know, I paid for it one time and. Yeah. I did. The only thing I found was the VIN number. Okay. All right. No worries. No worries. Let me just run these numbers. I mean, that other just it shocks me that my homeownership up that much. I mean, that's. And you know, I know you say it's based on the rate change. Yeah. That's based on what you all tell them. They don't just come up with that. No, we put. Right, John. So we put all that into there, and you probably are familiar with this: the replacement cost estimator. Each carrier has a replacement cost estimator. We take your tax card or any information you give us too, but all that information is put into that Raider and it populates that. So like. I don't I don't have to put it into anything. I can say it's two hundred and fifty dollars square foot is worth. Yeah. It's pretty simple. Yeah, this house isn't that big. You know it's not a big house and it's got a one car garage. Which is exactly what it is, John. I am going to go in here to the Raider with you on the phone and we're going to work through this. Just to make sure that nothing, I mean, it could be something wrong. That was in or wrong. So let's just walk through it while I have you on here. I am still here. I am trying to get into that. The Raider. I am not going anywhere. I am just. Okay. And I am pulling your tax card up as well. Okay, so I've got the tax card pulled up here, and it says on your tax card that it is eleven hundred sixteen square feet. Okay. You know that's probably not correct. There is a room behind the garage that it doesn't have heat and air. It's just a screened in porch. Let's see. Which I am not sure. And I think it's nine by. Right. Yeah, that's that's in that's not counting that room. This is counting. The heated square foot. I am looking at the tax card and it's got a drawing. You know, of course, on your for your home. Right. So it's got the base is eleven sixteen. And then it's got an open front porch, garage. Let's see another porch. Got two two porches on the side and one on the front. Let's see. But yeah, the the square footage that they're including for heated square footage. Is the base and that's eleven fourteen or eleven sixteen? I am so sorry. Okay, that's fine. They are showing an open frame porch of eighty five, a garage of two sixty four. Another frame porch, open porch of one sixty eight, and a patio of one sixty. Let's see. So. And it's on the concrete slab, correct. Right. Okay. All right. So we've got that. I am just making sure this estimator, like I said, the information, the data that was put into this. This replacement cost estimator tool is correct. But anyway, nineteen ninety seven, one story home on a concrete slab. It's got one one thousand one hundred sixteen square feet. It's got a two full baths. Is there two full baths in there? There is a bath and then a bath with a shower only. It's just one and three quarter. The both bathrooms have a shower. Yes, but one has a tub and the other doesn't. Right. If it has"}
{"source_file": "audio_files/exten-401-+19175395567-20250924-145433-1758740073.5465.WAV", "transcript_file": "transcripts/exten-401-+19175395567-20250924-145433-1758740073.5465.txt", "duration_seconds": 436.9, "process_seconds": 39.1, "char_count": 3944, "transcript": "Thank you for holding this, Heather. Yeah, hi, how you doing? I'm doing good. How are you? Good, good, good. Uh, I was calling. I was calling about um, I was trying to get a quote for a multifamily property that we have over there in Winston Salem. I do have current insurance, but it's expiring next month, and I was trying to see see a quote from all the vendors. Uh huh. Okay, um, who is it in charge right now? Huh. Who is the current carrier right now on that? Of guard, guard and traveler. Guard and travelers. Okay. Um, are you able to email me the copy, like your declaration, just to see if I can look at it and see which all you've gotten insured on it. Yeah, can you give me an email? I sure can. Yes, it's going to be Heather. It's H E A T H E R. Uh huh. S, as in Sam. Heather S. At the at sign. At what? My, like the at Heather S. At the at sign. Yeah, yeah, the at sign Heather S. So Heather's right. There's no like a period or anything in between. No, it's like plural Heather's. Oh, got it. Scott. Yeah, it's my name is Heather Scott, and they just used our first name and last um first initial of our last name. Okay, at. At my and that's my alliance, and that's going to be A L L I A M C E. Insurance, and insurance is spelled all the way out. It's not ins, but it's ins. Okay. U R A M C E dot com. Heather at my allianceinsurance dot com. That's right. Okay, give me a few minutes. I want to send you something, and can you reply back if you receive it or not? Absolutely, yes. So um now in in that email when you send me your policy, um, who is who all is on the policy? Is it are you is it in an LLC or is it? It is an LLC. Okay. Have any other properties do you insure? Can you give me just one minute? I'll show. Yeah, Senna. Hello, I'm here. Yes, okay. What was your question? Okay, how many other properties do you insure on the same LLC? None. It's just one, but it has three. Yeah, it has three. Which we call it three structures. Thank you. Okay. Have a great day. All right, yeah. So it's three buildings. What's the address? Sixteen thirty one. So it's basically three buildings. So it's sixteen thirty one, sixteen forty one, sixteen fifty one, West Northwest Boulevard, Winston Salem. Okay, and so they're all apartments that you rent. Say one more time. They're all apartments in there that you rent out, correct? Yes, uh huh. They're all rented out. It's all rented out. Okay, all right. How many do you have? What do you mean? How many apartments is there in each building? Oh, oh, I don't have the exact numbers. I believe one was there. Like two of them are like twelve, twelve, and the other one is fourteen or something like that. Okay, all right, all right, very good. Yeah, if you can um, if you'll include your phone number in that email. Yep. How's it looking? How's it looking for insurance for those types? Are they hard? Is it difficult? Is it easy to get? I mean, it it depends. It depends, you know. Um. How all the buildings are and have they been updated? Um. You know, have you updated any of these buildings? Yeah, they've been. Yeah, yeah, yeah, they've been. No. So they're they're all pretty much updated in. Yeah, they have um central AC. No, but they each one has their own unit AC heating unit. Okay, okay. No decline. So is it um what type of unit does each have that like for the AC? Like window units, is that what it is or? No, they're all one. They're all one bedroom. Okay. No. Yeah. Yeah, so um, is your current policy non renewing? I got that. Are you getting a are you getting a non renewal on your current policy? Yeah, one of them yes, and the other one said yeah. So one of them said yes, the other one said no, and the other other ones the guard guards is one that said no, but they only said no because they just want pictures of the the the front and the back showing that there's no grills outside. So basically, it's not like they're saying no, no. They just want like"}
